WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/RpcLit/SoapWsdl.BaseDataTypes.XmlFormatter.RpcLit_RetDateTime_Client_Request-17.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesRpcLit/RetDateTime</a:Action>
    <a:MessageID>urn:uuid:a809642a-a1ac-4a40-aaeb-67d56584e2fb</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetDateTime xmlns="http://tempuri.org/">
      <inDateTime xmlns="">2001-05-30T10:10:00-07:00</inDateTime>
    </RetDateTime>
  </s:Body>
</s:Envelope>